#### Terraform Plan 📝`success`

<details><summary>Show Plan</summary>

```terraform
random_id.this: Refreshing state... [id=QVzjSVbnX78]
module.compute.tls_private_key.ssh: Refreshing state... [id=c8098848dee304c13720676bcc6b21e171f5f16a]
module.compute.local_file.private_key: Refreshing state... [id=fed401f3955c2d70a238074c21933d8c6377818b]
module.compute.data.aws_ami.amazon_linux: Reading...
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::890742591881:oidc-provider/token.actions.githubusercontent.com]
module.networking.data.aws_availability_zones.available: Reading...
data.aws_region.current: Reading...
module.compute.aws_key_pair.main: Refreshing state... [id=rss-key]
module.vpc.aws_vpc.main: Refreshing state... [id=vpc-00546a76c2314dc2e]
data.aws_caller_identity.current: Reading...
module.test_bucket.aws_s3_bucket.this: Refreshing state... [id=test-bucket-415ce34956e75fbf]
aws_s3_bucket.terraform_state: Refreshing state... [id=rss-devops-terraform-state]
data.aws_region.current: Read complete after 0s [id=eu-north-1]
data.aws_caller_identity.current: Read complete after 0s [id=890742591881]
aws_iam_role.github_actions: Refreshing state... [id=GithubActionsRole]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/IAMFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062707057500000005]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonVPCFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706652800000002]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEventBridgeFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706647800000001]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonRoute53FullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062707303800000007]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonS3FullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706850400000003]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonSQSFullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062706852400000004]
aws_iam_role_policy_attachment.full_access["arn:aws:iam::aws:policy/AmazonEC2FullAccess"]: Refreshing state... [id=GithubActionsRole-20250706062707059100000006]
module.networking.data.aws_availability_zones.available: Read complete after 0s [id=eu-north-1]
module.compute.data.aws_ami.amazon_linux: Read complete after 0s [id=ami-0da6daf5e3e5ea2a8]
module.vpc.aws_internet_gateway.main: Refreshing state... [id=igw-0bbb03c7f2fda61e7]
module.security.aws_security_group.nat: Refreshing state... [id=sg-0700d66337fda5d98]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-0a9c2a6cb81277237]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0bdd3e052e4cef653]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0db28ab1b3e596ea1]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-0a6adafc336c2d09e]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-07f305aa841483246]
module.networking.aws_route_table.private: Refreshing state... [id=rtb-0b6082d117eb4fd32]
module.security.aws_security_group.public: Refreshing state... [id=sg-0e05d397a26fd4e79]
module.networking.aws_default_route_table.public: Refreshing state... [id=rtb-07a74d7f91fc46315]
aws_s3_bucket_server_side_encryption_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_versioning.state: Refreshing state... [id=rss-devops-terraform-state]
aws_s3_bucket_object_lock_configuration.state: Refreshing state... [id=rss-devops-terraform-state]
module.test_bucket.aws_s3_bucket_versioning.this: Refreshing state... [id=test-bucket-415ce34956e75fbf]
module.security.aws_network_acl.public: Refreshing state... [id=acl-0869919513af1a56d]
module.compute.aws_instance.nat: Refreshing state... [id=i-08d2f9b73f9a3850d]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0005083ac86ebb167]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0d3feee93ef754eed]
module.security.aws_security_group.private: Refreshing state... [id=sg-0c64469edac8ea536]
module.security.aws_security_group.k3s: Refreshing state... [id=sg-048bef2cd7eb7708a]
module.compute.aws_instance.bastion: Refreshing state... [id=i-0f48ce8bddd4b2264]
module.security.aws_network_acl.private: Refreshing state... [id=acl-05a8109ddba4baf2e]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0c1db32f6cd9b74e0]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-058b182c7f9f87ebb]
aws_route.private_nat: Refreshing state... [id=r-rtb-0b6082d117eb4fd321080289494]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.compute.local_file.private_key will be created
  + resource "local_file" "private_key" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "modules/compute/keys/rss-key.pem"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>